blog/drafts/python-kanren.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-22 Mon 17:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>miniKanren in Python</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">miniKanren in Python</h1>
<p>
In this article I will give an overview of the <code>kanren</code> library which is an implementation of miniKanren in python. We will go over the library's design. We assume that we are able to define <code>unify</code> and <code>reify</code> functions.
</p>

<div id="outline-container-org1efb20f" class="outline-2">
<h2 id="org1efb20f">Goals</h2>
<div class="outline-text-2" id="text-org1efb20f">
<p>
In <code>kanren</code> we wish to express relations between variables with <i>goals</i>:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">relation</span>(s, t):
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">relation_goal</span>(s):
        <span style="font-weight: bold;">pass</span>
    <span style="font-weight: bold;">pass</span>
</pre>
</div>

<p>
The simplest example of this is the <code>eq</code> relation, which specifies that two variables must unify:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> unification <span style="font-weight: bold;">import</span> unify, reify, var

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">eq</span>(u, v):
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">u and v are two variables. They can be python variables or logic variables</span>

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">eq_goal</span>(s):
        <span style="font-weight: bold; font-style: italic;">s</span> = unify(u, v, s)
        <span style="font-weight: bold;">if</span> s <span style="font-weight: bold;">is</span> <span style="font-weight: bold;">not</span> <span style="font-weight: bold; text-decoration: underline;">False</span>:
            <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">iter</span>((s,))
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">iter</span>(())

    <span style="font-weight: bold;">return</span> eq_goal
</pre>
</div>

<p>
Initial state is the empty dictionary <code>{}</code>. Then what <code>run</code> does is reifying the input variable with whatever
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">q</span> = var(<span style="font-style: italic;">'q'</span>)
<span style="font-weight: bold; font-style: italic;">goal</span> = eq(q, 1)
<span style="font-weight: bold; font-style: italic;">res</span> = <span style="font-weight: bold;">next</span>(goal({}))
reify(q, res)
</pre>
</div>

<p>
is equivalent to the following:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> kanren <span style="font-weight: bold;">import</span> var, run, eq

<span style="font-weight: bold; font-style: italic;">q</span> = var(<span style="font-style: italic;">'q'</span>)
<span style="font-weight: bold; font-style: italic;">res</span> = run(0, q, eq(q, 1.))
<span style="font-weight: bold;">print</span>(res[0])
</pre>
</div>

<p>
So far so good, nothing exceptional here. Difficulty comes when we add logic to combine goals.
</p>
</div>
</div>

<div id="outline-container-org5d2fbab" class="outline-2">
<h2 id="org5d2fbab">Combining goals</h2>
<div class="outline-text-2" id="text-org5d2fbab">
</div>
<div id="outline-container-org427104e" class="outline-3">
<h3 id="org427104e">Conjunction of goals</h3>
<div class="outline-text-3" id="text-org427104e">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">conj</span>(goal1, goal2):

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">and_goal</span>(S):
        <span style="font-weight: bold; font-style: italic;">S1</span> = goal1(S)
        <span style="font-weight: bold;">yield</span> <span style="font-weight: bold;">from</span> <span style="font-weight: bold;">map</span>(goal2, S1)

    <span style="font-weight: bold;">return</span> and_goal
</pre>
</div>

<p>
So we can now use our <code>eq</code> operator defined above. This is where the possibility to pass a <code>state</code> to <code>unify</code> shows its usefulness:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">goal1</span> = eq(q, 2)
<span style="font-weight: bold; font-style: italic;">goal2</span> = eq(q, 3)

<span style="font-weight: bold; font-style: italic;">state1</span> = <span style="font-weight: bold;">next</span>(goal1({}))
<span style="font-weight: bold;">print</span>(state1)

<span style="font-weight: bold; font-style: italic;">state2</span> = <span style="font-weight: bold;">next</span>(goal2({}))
<span style="font-weight: bold;">print</span>(state2)

<span style="font-weight: bold;">print</span>(<span style="font-weight: bold;">next</span>(goal2({q: 3})))
<span style="font-weight: bold;">print</span>(<span style="font-weight: bold;">next</span>(goal2({q: 2})))
</pre>
</div>

<p>
Yep, if the state is incompatible then the iterator has nothing to offer. This looks like the following:
</p>

<div class="org-src-container">
<pre class="src src-ascii">| goal1 | ---&gt; unified state1 ---&gt; | goal2 | ---&gt; unified state compatible with state1
</pre>
</div>

<p>
<i>Unify does all the work here</i>.
</p>
</div>
</div>

<div id="outline-container-org2d1c4cc" class="outline-3">
<h3 id="org2d1c4cc">Disjunctions of goals</h3>
<div class="outline-text-3" id="text-org2d1c4cc">
<p>
Here we just interleave results. Both branches are contributing possible states. The current implementation uses a naive interleaving mechanism.
</p>
</div>
</div>

<div id="outline-container-orgd5328e4" class="outline-3">
<h3 id="orgd5328e4">Conditional</h3>
</div>
<div id="outline-container-orgf9e95af" class="outline-3">
<h3 id="orgf9e95af">Negations</h3>
</div>
</div>
</div>
</body>
</html>
